import random
def вгадай_число():
    загадане_число = random.randint(1, 100)
    спроби = 0
    print("Вгадай число від 1 до 100")
    while True:
        введене_число = int(input("Твоє число: "))
        спроби += 1
        if введене_число == загадане_число:
            print(f"Вітаю! Ти вгадав число {загадане_число} за {спроби} спроб.")
            break
        elif введене_число < загадане_число:
            print("Загадане число більше. Спробуй ще.")
        else:
            print("Загадане число менше. Спробуй ще.")
if __name__ == "__main__":
    вгадай_число()
